n5/src/Documents/Commissioning/Commissioning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Commissioning</name>
  <basedOn>Document.VendorInvoice</basedOn>
  <basedOn>Document.ExpenseReport</basedOn>
  <registerRecords>InformationRegister.Depreciation</registerRecords>
  <registerRecords>InformationRegister.Commissioning</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>InformationRegister.FixedAssetsLocation</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.Cost</registerRecords>
  <attributes>
    <name>Approved</name>
    <type>
      <types>DefinedType.Member</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovedPosition</name>
    <type>
      <types>DefinedType.MemberPosition</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.VendorInvoice</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Head</name>
    <type>
      <types>DefinedType.Member</types>
    </type>
  </attributes>
  <attributes>
    <name>HeadPosition</name>
    <type>
      <types>DefinedType.MemberPosition</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>InProgress</name>
    <attributes>
      <name>Acceleration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Charge</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>FixedAsset</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>LiquidationValue</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Method</name>
      <type>
        <types>EnumRef.Amortization</types>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.DepreciationSchedules</types>
      </type>
    </attributes>
    <attributes>
      <name>Starting</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UsefulLife</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Acceleration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Charge</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>FixedAsset</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>LiquidationValue</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Method</name>
      <type>
        <types>EnumRef.Amortization</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Posted</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.DepreciationSchedules</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Starting</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UsefulLife</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Members</name>
    <attributes>
      <name>Member</name>
      <type>
        <types>DefinedType.Member</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>DefinedType.MemberPosition</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Enums/Amortization/Amortization.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Amortization</name>
  <enumValues>
    <name>Linear</name>
  </enumValues>
  <enumValues>
    <name>Cumulative</name>
  </enumValues>
  <enumValues>
    <name>Decreasing</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/FixedAssets/FixedAssets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FixedAssets</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AssetType</name>
    <type>
      <types>CatalogRef.AssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Certificate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DepreciationAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>FixedBasis</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Inventory</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Manufacturer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>OfficialCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Produced</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Serial</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>EnumRef.FixedAssetGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>Weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Documents/Commissioning/Forms/InProgressRow/Module.bsl
&AtClient
var TableRow export;
&AtClient
var SelectedValue;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	Options.Company ( ThisObject, Object.Company );
	CommissioningForm.FixedAssetAppearance ( ThisObject );

EndProcedure

&AtServer
Procedure loadParams ()
	
	Object.Company = Parameters.Company;
	
EndProcedure 

&AtClient
Procedure OnOpen ( Cancel )
	
	loadData ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtClient
Procedure loadData ()
	
	owner = FormOwner.Object;
	Object.Date = owner.Date;
	TableRow = Object.InProgress.Add ();
	data = FormOwner.Items.InProgress.CurrentData;
	Inventory = data.Item;
	FillPropertyValues ( TableRow, data );
	if ( TableRow.Method.IsEmpty () ) then
		TableRow.Method = PredefinedValue ( "Enum.Amortization.Linear" );
	endif; 

EndProcedure

&AtClient
Procedure BeforeClose ( Cancel, Exit, MessageText, StandardProcessing )
	
	if ( SelectedValue = undefined ) then
		Cancel = true;
		pickValue ( Enum.ChoiceOperationsFixedAssetInProgress (), undefined );
	endif;
	
EndProcedure

&AtClient
Procedure pickValue ( Operation, Value )
	
	SelectedValue = new Structure ();
	SelectedValue.Insert ( "Operation", Operation );
	SelectedValue.Insert ( "Value", Value );
	SelectedValue.Insert ( "NewRow", Parameters.NewRow );
	#if ( WebClient ) then
		// Bug workaround 8.3.14.1592. NotifyChoice () will not close the form.
		// Idle handler is required
		AttachIdleHandler ( "startChoosing", 0.01, true );
	#else
		NotifyChoice ( SelectedValue );
	#endif
	
EndProcedure

&AtClient
Procedure startChoosing ()
	
	NotifyChoice ( SelectedValue );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	applyCommand ( Enum.ChoiceOperationsFixedAssetInProgress () );
	
EndProcedure

&AtClient
Procedure applyCommand ( Command )
	
	FormOwner.Modified = true;
	pickValue ( Command, TableRow );
	
EndProcedure 

&AtClient
Procedure SaveAndNew ( Command )
	
	applyCommand ( Enum.ChoiceOperationsFixedAssetInProgressSaveAndNew () );
	
EndProcedure

&AtClient
Procedure MethodOnChange ( Item )
	
	CommissioningForm.MethodOnChage ( ThisObject );
	
EndProcedure

&AtClient
Procedure ItemOnChange ( Item )
	
	CommissioningForm.SetAmount ( ThisObject );
	
EndProcedure

&AtClient
Procedure ItemAccountOnChange ( Item )
	
	CommissioningForm.SetAmount ( ThisObject );
	
EndProcedure

&AtClient
Procedure FixedAssetCreating ( Item, StandardProcessing )
	
	StandardProcessing = false;
	newAsset ( Item );
	
EndProcedure

&AtClient
Procedure newAsset ( Item )
	
	p = new Structure ();
	p.Insert ( "ChoiceMode", true );
	p.Insert ( "FillingText", ? ( Item.EditText = "", String ( Inventory ), Item.EditText ) );
	OpenForm ( "Catalog.FixedAssets.ObjectForm", p, Item, , , , , FormWindowOpeningMode.LockOwnerWindow );
		
EndProcedure 

&AtClient
Procedure ChargeOnChange ( Item )
	
	resetDate ();
	Appearance.Apply ( ThisObject, "TableRow.Charge" );
	
EndProcedure

&AtClient
Procedure resetDate ()
	
	if ( TableRow.Charge ) then
		TableRow.Starting = BegOfMonth ( AddMonth ( Object.Date, 1 ) );
	else
		TableRow.Starting = undefined;
	endif; 
	
EndProcedure 

&AtClient
Procedure StartingOnChange ( Item )
	
	TableRow.Starting = BegOfMonth ( TableRow.Starting );
	
EndProcedure
